[
  {
    "name": "Folic Acid 400mcg Tablets (60 tablets)",
    "genericName": "Folic Acid",
    "category": "Women's Health",
    "description": "Essential folic acid supplement for women of childbearing age, especially important before and during pregnancy. Helps prevent neural tube defects in developing babies. Supports red blood cell formation and DNA synthesis. Recommended daily intake for women planning pregnancy is 400-800mcg. Take one tablet daily with water, preferably in the morning. Can be taken with or without food. Store in a cool, dry place away from sunlight. Also beneficial for women with anemia or taking certain medications that deplete folate. Begin taking at least one month before conception and continue through first trimester. Doctor-recommended for overall reproductive health.",
    "price": 250.00,
    "stock": 800,
    "manufacturer": "Square Pharmaceuticals",
    "expiryDate": "2025-11-30",
    "medicineType": "OTC",
    "imageURL": "https://www.nutrifactor.com.pk/cdn/shop/products/FolicAcid60_9cdc5995-767f-4d65-a515-b3535a5ebe49_grande.png?v=1656419104",
    "sellerName": "Md Seller Mia",
    "sellerEmail": "seller@gmail.com",
    "discount": 10
  },
  {
    "name": "Evening Primrose Oil 1000mg Softgels (60 caps)",
    "genericName": "Oenothera Biennis Oil",
    "category": "Women's Health",
    "description": "Natural source of gamma-linolenic acid (GLA) to support women's hormonal balance. May help relieve PMS symptoms like breast tenderness, mood swings and bloating. Supports healthy skin and may reduce menopausal discomfort. Take 1-2 softgels daily with meals. Results may take 2-3 menstrual cycles to become noticeable. Store in a cool, dry place away from direct sunlight. Not recommended during pregnancy without doctor's advice. Vegan-friendly capsules. Also contains vitamin E as a natural preservative. Particularly beneficial for women with cyclical breast pain or hormonal acne. Maintain consistent use for best results.",
    "price": 600.00,
    "stock": 500,
    "manufacturer": "Nature's Bounty",
    "expiryDate": "2025-08-15",
    "medicineType": "OTC",
    "imageURL": "https://m.media-amazon.com/images/I/71a8VLD7SxL.jpg",
    "sellerName": "Md Seller Mia",
    "sellerEmail": "seller@gmail.com",
    "discount": 15
  },
  {
    "name": "Iron + Vitamin C Tablets (30 tablets)",
    "genericName": "Ferrous Fumarate + Ascorbic Acid",
    "category": "Women's Health",
    "description": "Combination supplement to prevent and treat iron-deficiency anemia common in women. Contains 65mg elemental iron with vitamin C to enhance absorption. Especially important for women with heavy periods, pregnant women, or those on restricted diets. Take one tablet daily on an empty stomach with water, or as directed by physician. May cause dark stools - this is harmless. Avoid taking with dairy, tea or coffee as they reduce absorption. Store in a cool, dry place. Vitamin C helps reduce common side effects like constipation. Consult doctor before use if you have iron storage disorders.",
    "price": 350.00,
    "stock": 600,
    "manufacturer": "Beximco Pharmaceuticals",
    "expiryDate": "2025-05-20",
    "medicineType": "OTC",
    "imageURL": "https://images.hollandandbarrettimages.co.uk/productimages/HB/724/047337_A.png",
    "sellerName": "Md Seller Mia",
    "sellerEmail": "seller@gmail.com",
    "discount": 5
  },
  {
    "name": "Cranberry Urinary Health Capsules (60 caps)",
    "genericName": "Vaccinium Macrocarpon",
    "category": "Women's Health",
    "description": "High-potency cranberry extract to support urinary tract health and prevent recurrent UTIs. Contains proanthocyanidins (PACs) that prevent bacteria from adhering to bladder walls. Take 1 capsule daily with water, or 2 capsules at first sign of discomfort. May help reduce frequency of urinary tract infections. Not a substitute for antibiotics during active infection. Vegetarian capsules. Suitable for long-term use. Also contains vitamin C to acidify urine. Particularly beneficial for women prone to UTIs after intercourse. Store in a cool, dry place. Drink plenty of water when taking this supplement. Results typically seen after 4-6 weeks of consistent use.",
    "price": 750.00,
    "stock": 400,
    "manufacturer": "Now Foods",
    "expiryDate": "2025-09-30",
    "medicineType": "OTC",
    "imageURL": "https://m.media-amazon.com/images/I/61D24PEEDXL._UF1000,1000_QL80_.jpg",
    "sellerName": "Md Seller Mia",
    "sellerEmail": "seller@gmail.com",
    "discount": 10
  },
  {
    "name": "Calcium + Vitamin D3 + Magnesium Tablets (60 tablets)",
    "genericName": "Calcium Carbonate + Cholecalciferol + Magnesium Oxide",
    "category": "Women's Health",
    "description": "Complete bone support formula for women at all life stages. Provides 1000mg calcium, 800IU vitamin D3, and 400mg magnesium per daily dose. Essential for maintaining bone density and preventing osteoporosis. Especially important for pregnant/breastfeeding women, menopausal women, and those on restricted diets. Vitamin D enhances calcium absorption while magnesium aids utilization. Take 2 tablets daily, preferably with meals. May help reduce PMS symptoms and muscle cramps. Store in a cool, dry place away from direct sunlight. Not to be taken with iron supplements as they interfere with absorption. Doctor-recommended for women over 30.",
    "price": 550.00,
    "stock": 450,
    "manufacturer": "Renata Limited",
    "expiryDate": "2025-07-31",
    "medicineType": "OTC",
    "imageURL": "https://cloudinary.images-iherb.com/image/upload/f_auto,q_auto:eco/images/cen/cen22263/y/27.jpg",
    "sellerName": "Md Seller Mia",
    "sellerEmail": "seller@gmail.com",
    "discount": 0
  },
  {
    "name": "Menstrual Pain Relief Tablets (10 tablets)",
    "genericName": "Mefenamic Acid 500mg",
    "category": "Women's Health",
    "description": "Effective relief for moderate to severe menstrual cramps (dysmenorrhea) and heavy menstrual bleeding. Non-steroidal anti-inflammatory drug (NSAID) that reduces prostaglandin production. Take one tablet every 8 hours with food as needed during menstruation. Begin at first sign of cramps for best results. Do not exceed 3 tablets in 24 hours. May cause stomach upset - take with food. Not recommended for women with ulcers or kidney problems. Store at room temperature away from moisture. Provides faster relief than paracetamol for menstrual pain. Consult doctor if pain persists beyond menstrual period. Keep track of menstrual flow as effective for reducing heavy bleeding.",
    "price": 120.00,
    "stock": 700,
    "manufacturer": "Incepta Pharmaceuticals",
    "expiryDate": "2025-04-15",
    "medicineType": "OTC",
    "imageURL": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT4iU7P1P7zCYUzY17bOoIZGQy9dEdNC1Y_nA&s",
    "sellerName": "Md Seller Mia",
    "sellerEmail": "seller@gmail.com",
    "discount": 20
  }
]